cf/Documents/ОтгрузкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОтгрузкаТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыСобранные</xr:Item>
				<xr:Item>AccumulationRegister.СборкаЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыНаПеремещения</xr:Item>
				<xr:Item>AccumulationRegister.СборщикЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПути</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ОтгруженныеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписыватьСборку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборочныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладЯчейкаСборки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/СборочныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СборочныйЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыСобранные</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.СборщикЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВСборке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Удалить_Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Заказ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСборочногоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСборочныхЛистов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаСобранногоТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЖесткаяУпаковка</Name>
					<Comment>Количество в жесткой упаковке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Заказ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеНайдено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собрать</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ячейки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Catalogs/УпаковкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>УпаковкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Comment>Высота упаковки в миллиметрах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Comment>Длина упаковки в миллиметрах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесПустойУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупочная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автонаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Documents/ОтгрузкаТоваров/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Если НЕ ПроведенияДокументов.РазрешеноПерепроводитьДокумент(Ссылка) Тогда
		Возврат;
	КонецЕсли;	
	
	ДатаНачалаРаботыСборкиПоНовому = '20131030';
	
	Заказ = БизнесПроцессы.ПеремещениеТоваров.ПолучитьЗаказ(Ссылка.Процесс);
	ПолучитьТаблицуПоРезервам = 
			Не Ссылка.Процесс.Пустая() И
			ЗначениеЗаполнено(Заказ);
			
	СписыватьСборку = Не Ссылка.Процесс.Пустая() И Ссылка.Процесс.ЗаказСобран;  // это перемещение типа внутреннего
			
	ИменаРегистров = Новый Массив;
	ПоВсем=Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИменаРегистров",ИменаРегистров) Тогда
		ПоВсем=Истина;
		ИменаРегистров = Новый Массив;
	КонецЕсли;	
	
	
	ТекстЗапроса=КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	
	"//>>> Шапка

	|ВЫБРАТЬ
	|	СкладОтправитель, СкладПолучатель
	|ИЗ
	|	Документ.ОтгрузкаТоваров
	|ГДЕ
	|	Ссылка = &Ссылка";
	
	
	
	Нтаб=Новый Структура;
	ТекНомер=1;	
		
	Если ИменаРегистров.Найти("ТоварыНаСкладах")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыНаСкладах",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыНаСкладах
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Ссылка.СкладОтправитель		КАК Склад,
		|	Номенклатура	            КАК Номенклатура,
		|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
		|		СУММА(Количество)
		|	ИНАЧЕ
		|		СУММА(Количество*Упаковка.Коэффициент)
		|	КОНЕЦ				КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка.СкладОтправитель,
		|	Номенклатура,
		|	Упаковка
		|ИМЕЮЩИЕ СУММА(Количество) <> 0"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ТоварыВПути")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВПути",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыВПути
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияПриход			КАК ВидДвижения,
		|	Ссылка.Процесс.Заказчик 	КАК Заказчик,
		|	Ссылка.СкладОтправитель		КАК СкладОтправитель,
		|	Ссылка.СкладПолучатель		КАК СкладПолучатель,
		|	Ссылка.Маршрут				КАК Маршрут,
		|	Номенклатура	            КАК Номенклатура,
		|	Упаковка					КАК Упаковка,
		|	СУММА(Количество)			КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка.Процесс.ЗаказЧик,
		|	Ссылка.СкладОтправитель,
		|	Ссылка.СкладПолучатель,
		|	Ссылка.Маршрут,
		|	Номенклатура,
		|	Упаковка
		|ИМЕЮЩИЕ СУММА(Количество) <> 0"
		
	КонецЕсли;	
		
	
	Если ИменаРегистров.Найти("ТоварыВЯчейках")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВЯчейках",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыВЯчейках
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Ячейка						КАК Ячейка,
		|	Номенклатура	            КАК Номенклатура,
		|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
		|		СУММА(Количество)
		|	ИНАЧЕ
		|		СУММА(Количество*Упаковка.Коэффициент)
		|	КОНЕЦ						КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка И
		|	Ячейка <> &ПустаяЯчейка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ячейка,
		|	Номенклатура,
		|	Упаковка
		|ИМЕЮЩИЕ СУММА(Количество) <> 0"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ТоварыВРезерве")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВРезерве",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыВРезерве
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Ссылка.СкладОтправитель		КАК Размещение,
		|	&Заказ						КАК ДокументРезерва,
		|	Номенклатура	            КАК Номенклатура,
		|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
		|		СУММА(Количество)
		|	ИНАЧЕ
		|		СУММА(Количество*Упаковка.Коэффициент)
		|	КОНЕЦ						КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	&ПолучитьТаблицуПоРезервам = ИСТИНА И
		|	НЕ ДокументРезерва.Дата ЕСТЬ NULL И
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка.СкладОтправитель,
		|	Номенклатура,
		|	Упаковка
		|ИМЕЮЩИЕ СУММА(Количество) <> 0"
		
	КонецЕсли;	
	
	
	
	Если ИменаРегистров.Найти("СборщикЗаказа")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("СборщикЗаказа",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> СборщикЗаказа
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	Сборщик						КАК Сборщик,
		|	&Заказ						КАК Заказ,
		|	Номенклатура				КАК Номенклатура,
		|	Упаковка					КАК Упаковка,
		|	Ссылка.СкладОтправитель		КАК Склад,
		|  	Ячейка						КАК Ячейка,		
		|	СУММА(Количество)			КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка И
		|	Сборщик <> &ПустойСборщик
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка,
		|	Сборщик,
		|	Номенклатура,
		|	Упаковка,
		|	Ячейка
		|ИМЕЮЩИЕ
		|	СУММА(Количество) <> 0"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ДвижениеТовара")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ДвижениеТовара",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ДвижениеТовара
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	Ссылка.СкладОтправитель		КАК Склад,
		|	&Заказ 	Заказ,
		|	Номенклатура,
		|	Упаковка, 
		|	-СУММА(Количество) Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Упаковка"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ОтгруженныеЗаказы")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ОтгруженныеЗаказы",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ОтгруженныеЗаказы
		
		|ВЫБРАТЬ
		|	&Период	Период,
		|	&Заказ 	Заказ,
		|	Ссылка	ДокументОтгрузки,
		|	СУММА(Номенклатура.Вес * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ВесПодготовлено,
		|	СУММА(Номенклатура.Объем * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ОбъемПодготовлено
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ТоварыСобранные")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыСобранные",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыСобранные
		
		|ВЫБРАТЬ
		|	&Период				КАК Период,
		|	&ВидДвиженияРасход	КАК ВидДвижения,
		|	Ссылка.СкладОтправитель		Склад,
		//|	Ссылка.СборочныйЛист.Заказ 	Заказ,
		|	Ссылка.Процесс.Заказчик.Заказ Заказ,
		|	Ссылка.СборочныйЛист		СборочныйЛист,
		|	Номенклатура,
		|	Упаковка,
		|	СУММА(Количество) КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка И Ссылка.СборочныйЛист <> &ПустойСборочныйЛист
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Упаковка"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ЗаказыНаПеремещения")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ЗаказыНаПеремещения",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ЗаказыНаПеремещения
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Ссылка.СкладОтправитель		КАК СкладОтправитель,
		|	&Заказ 	Заказ,
		|	Номенклатура,
		|	Упаковка, 
		|	Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ВнутренниеЗаказы")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ВнутренниеЗаказы",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		// ВнутренниеЗаказы
		
		"ВЫБРАТЬ Неопределено где Истина=Ложь"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("СборкаЗаказа")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("СборкаЗаказа",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> СборкаЗаказа
		|выбрать неопределено где истина=ложь"
		
	КонецЕсли;	
	
	
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Заказ", 				Заказ);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 		Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПолучитьТаблицуПоРезервам", 	ПолучитьТаблицуПоРезервам);
	Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("СписыватьСборку", 	СписыватьСборку);
	Запрос.УстановитьПараметр("ПустойСборщик", 		Справочники.ФизическиеЛица.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата1", 				Ссылка.Дата);
	Запрос.УстановитьПараметр("ПустойСборочныйЛист",Документы.СборочныйЛист.ПустаяСсылка());
	
	
	Запрос.Текст=ТекстЗапроса;
	Пакет = Запрос.ВыполнитьПакет();

	Для Каждого Элем Из Нтаб Цикл
		ДополнительныеСвойства.Вставить(Элем.Ключ,Пакет[Элем.Значение].Выгрузить());
	КонецЦикла;	
	
	
//	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
//	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
//	ДополнительныеСвойства.Вставить("ТоварыНаСкладах", 	Пакет[2].Выгрузить());
//	ДополнительныеСвойства.Вставить("ТоварыВПути", 		Пакет[3].Выгрузить());
////	ДополнительныеСвойства.Вставить("ВнутренниеЗаказы", Пакет[4].Выгрузить());
//	ДополнительныеСвойства.Вставить("ТоварыВЯчейках", 	Пакет[5].Выгрузить());
//	ДополнительныеСвойства.Вставить("ТоварыВРезерве", 	Пакет[6].Выгрузить());
//	ДополнительныеСвойства.Вставить("СборкаЗаказа", 	Пакет[?(ТекущаяДата() > ДатаНачалаРаботыСборкиПоНовому, 8, 7)].Выгрузить());
//	ДополнительныеСвойства.Вставить("СборщикЗаказа", 	Пакет[9].Выгрузить());
//	ДополнительныеСвойства.Вставить("ДвижениеТовара",	Пакет[10].Выгрузить());
//	//ДополнительныеСвойства.Вставить("ПартииТоваров",	Пакет[12].Выгрузить());
//	ДополнительныеСвойства.Вставить("ТоварыСобранные",	Пакет[13].Выгрузить());
//	ДополнительныеСвойства.Вставить("ЗаказыНаПеремещения",	Пакет[14].Выгрузить());
//	
//	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда ДополнительныеСвойства.Вставить("ОтгруженныеЗаказы", Пакет[11].Выгрузить()) КонецЕсли;
//	
//	// Разнесем табличку сборок
//	
//	Если Не ДополнительныеСвойства.СборкаЗаказа.Количество() И СписыватьСборку Тогда
//		
//		ТаблицаСборки = Пакет[7].Выгрузить();
//		Если ТаблицаСборки.Количество() Тогда
//			
//			ТаблицаРазмазаннойСборки = КонтрольПроведения.РазмазатьТаблицуВТаблицеПоМинимальнымРесурсам(
//					ТаблицаСборки,
//					ДополнительныеСвойства.ТоварыНаСкладах,
//					"Номенклатура",
//					"Количество");
//					
//			ТаблицаРазмазаннойСборки.Колонки.Количество.Имя = "Собрано";
//			ДополнительныеСвойства.СборкаЗаказа = ТаблицаРазмазаннойСборки; КонецЕсли; КонецЕсли;

КонецПроцедуры
